<!DOCTYPE html>
<html>
<head>
  <title> Mulheres de TI que te Inspiram </title>
  <style>
    h1 {
      text-align: center;
    }
    img.center {
    display: block;
    margin: 0 auto;
}
    </style>
</head>
  <strong><h1>Mulheres de TI que te Inspiram</h1></strong>
<p><br />
<p>H&aacute; v&aacute;rias mulheres que ganharam destaque ao longo da hist&oacute;ria da tecnologia, seja na cria&ccedil;&atilde;o de um algoritmo, uma linguagem ou de um game cl&aacute;ssico! Ter refer&ecirc;ncias &eacute; algo muito importante para servir de inspira&ccedil;&atilde;o ao longo da carreira. Por isso, nesta edi&ccedil;&atilde;o da s&eacute;rie, trouxemos alguns nomes fundamentais de mulheres que deixaram sua marca.</p>
<h2>1. Ada Lovelace</h2>
<p><img class="center" alt="Ada Lovelace." src="https://www.alura.com.br/artigos/assets/mulheres-historia-tecnologia-programacao/ada-lovelace.jpg" /></p>
<p>A brit&acirc;nica&nbsp;Ada Lovelace</a>&nbsp;foi a primeira programadora da hist&oacute;ria. Ela viveu por apenas 36 anos, at&eacute; 1852, mas foi ela quem previu que os computadores fariam mais do que simples c&aacute;lculos matem&aacute;ticos, criando o&nbsp;primeiro algoritmo &nbsp;capaz de ser processado por uma m&aacute;quina.</p>
<p>Apesar de n&atilde;o possuir os recursos necess&aacute;rios na &eacute;poca para testar seus estudos, o seu trabalho foi validado posteriormente &agrave; sua morte, quando os equipamentos necess&aacute;rios tornaram-se dispon&iacute;veis.</p>
<p>Atualmente, a Sociedade Brit&acirc;nica de Computa&ccedil;&atilde;o conta com um pr&ecirc;mio que leva o seu nome e coloca em evid&ecirc;ncia avan&ccedil;os significativos em sistemas de informa&ccedil;&atilde;o.&nbsp;</p>
<h2>2. Mary Kenneth Keller</h2>
<p><img class="center" alt="Mary Kenneth Keller." src="https://www.alura.com.br/artigos/assets/mulheres-historia-tecnologia-programacao/mary-kenneth-keller.jpg" /></p>
<p>Mary Kenneth Keller foi uma freira e tamb&eacute;m a primeira mulher a&nbsp;conquistar um doutorado&nbsp;em Ci&ecirc;ncias da Computa&ccedil;&atilde;o.</p>
<p>Em sua biografia, destaca-se a importante participa&ccedil;&atilde;o na cria&ccedil;&atilde;o da linguagem de programa&ccedil;&atilde;o&nbsp;BASIC, a autoria de&nbsp;quatro livros &nbsp;que s&atilde;o refer&ecirc;ncia em computa&ccedil;&atilde;o e programa&ccedil;&atilde;o, al&eacute;m da&nbsp;funda&ccedil;&atilde;o de um departamento&nbsp;de ci&ecirc;ncias da computa&ccedil;&atilde;o na Universidade Clarke, onde atuou como diretora at&eacute; falecer em 1985.</p>
<p>Muito envolvida com a educa&ccedil;&atilde;o, h&aacute; registros de suas ideias vision&aacute;rias sobre como o computador seria essencial para auxiliar as pessoas no aprendizado, al&eacute;m daquelas acerca da&nbsp;intelig&ecirc;ncia artificial, em uma &eacute;poca em que s&oacute; se achava o tema na fic&ccedil;&atilde;o cient&iacute;fica.</p>
<h2>3. Grace Hopper</h2>
<p><img class="center" alt="Grace Hopper." src="https://www.alura.com.br/artigos/assets/mulheres-historia-tecnologia-programacao/grace-hopper.jpg" /></p>
<p>Sabe quando &ldquo;d&aacute; um&nbsp;bug&rdquo; no computador? Uma curiosidade sobre Grace Hopper &eacute; que foi por causa dela que come&ccedil;amos a chamar as falhas de &ldquo;bug&rdquo;. Isso porque Grace, ao tentar encontrar a origem de um problema em seu computador, descobriu um inseto morto dentro da m&aacute;quina.</p>
<p>Mas a maior contribui&ccedil;&atilde;o de Hopper sem d&uacute;vida foi durante sua atua&ccedil;&atilde;o como analista de sistemas da Marinha dos Estados Unidos, nas d&eacute;cadas de 1940 e 1950. Ela ficou conhecida como &ldquo;vov&oacute; do&nbsp;COBOL&rdquo; por ter desenvolvido a base para a Common Business Oriented Language, usada at&eacute; a atualidade no processamento de bancos de dados comerciais.</p>
<p>Por sua grande contribui&ccedil;&atilde;o, desde 1994 &eacute; realizado em sua homenagem o congresso Grace Hopper Celebration of Women in Computing, que celebra os feitos das mulheres no mundo da computa&ccedil;&atilde;o anualmente.</p>
<h2>4. Carol Shaw</h2>
<p><img class="center" alt="Carol Shaw." src="https://www.alura.com.br/artigos/assets/mulheres-historia-tecnologia-programacao/carol-shaw.jpg" /></p>
<p>A Carol Shaw foi a&nbsp;primeira mulher&nbsp;a desbravar o universo dos games, na d&eacute;cada de 70. Quando trabalhava na Atari, ela lan&ccedil;ou comercialmente o primeiro jogo criado por uma mulher, o&nbsp;3-D Tic-Tac-Toe, que tinha como base o tradicional&nbsp;jogo da velha.</p>
<p>Depois, na Activision, ela programou seu jogo de maior repercuss&atilde;o: o&nbsp;River Raid</strong, um cl&aacute;ssico que ficou entre os mais populares de sua &eacute;poca. Diferente dos v&aacute;rios games de tiro existentes at&eacute; aquele momento, em que o jogo acontecia em uma tela fixa, no River Raid o avi&atilde;o se&nbsp;movia verticalmente&nbsp;ao longo de um rio e combatia inimigos, como outros avi&otilde;es, navios e helic&oacute;pteros.</p>
<p>A hist&oacute;ria de Shaw &eacute; at&eacute; hoje uma inspira&ccedil;&atilde;o para a participa&ccedil;&atilde;o de mulheres na ind&uacute;stria dos videogames.</p>
<h2>5. Hedy Lamarr</h2>
<p><img class="center" alt="Hedy Lamarr." src="https://www.alura.com.br/artigos/assets/mulheres-historia-tecnologia-programacao/hedy-lamarr.jpg" /></p>
<p>Se hoje temos smartphones conectados ao Wi-Fi, devemos um agradecimento para Hedy Lamarr, uma atriz e inventora austr&iacute;aca nascida em 1914. Junto com o compositor e inventor George Antheil, ela criou um&nbsp;aparelho de interfer&ecirc;ncia em r&aacute;dio&nbsp;para despistar radares nazistas, durante a Segunda Guerra.</p>
<p>Na &eacute;poca, a ideia pareceu complicada demais para ser aplicada pelo Departamento de Guerra dos EUA e acabou ficando na gaveta at&eacute; 1962, quando o aparelho passou a ser usado por tropas militares em Cuba.</p>
</body>
</html>
